; domain
(define (domain blocksword)
    (:predicates
        (sin_nada_encima ?x)
        (mas_pequeno ?x ?y)
        (encima_de ?x ?y)
    )
    (:action mover
        :parameters (?inicial ?final ?disco)
        :precondition (and 
            (sin_nada_encima ?disco) 
            (sin_nada_encima ?final)
            (encima_de ?disco ?inicial) 
            (mas_pequeno ?disco ?final)            
        )
        :effect (and 
            (sin_nada_encima ?inicial)                        
            (not 
                (sin_nada_encima ?final)
            )
            (encima_de ?disco ?final)
            (not
                (encima_de ?disco ?inicial)
            )
        )
    )    
)

; problem
(define (problem phanoi)
  (:domain blocksword)
  (:objects
    disco1 disco2 disco3 disco4 disco5 torre1 torre2 torre3
  )
  (:init
    (mas_pequeno disco1 torre1)    
    (mas_pequeno disco1 torre2)
    (mas_pequeno disco1 torre3)

    (mas_pequeno disco2 torre1)    
    (mas_pequeno disco2 torre2)
    (mas_pequeno disco2 torre3)

    (mas_pequeno disco3 torre1)    
    (mas_pequeno disco3 torre2)
    (mas_pequeno disco3 torre3)

    (mas_pequeno disco4 torre1)    
    (mas_pequeno disco4 torre2)
    (mas_pequeno disco4 torre3)

    (mas_pequeno disco5 torre1)    
    (mas_pequeno disco5 torre2)
    (mas_pequeno disco5 torre3)

    (mas_pequeno disco1 disco2)
    (mas_pequeno disco1 disco3)
    (mas_pequeno disco1 disco4)
    (mas_pequeno disco1 disco5)

    (mas_pequeno disco2 disco3)
    (mas_pequeno disco2 disco4)
    (mas_pequeno disco2 disco5)
    
    (mas_pequeno disco3 disco4)
    (mas_pequeno disco3 disco5)    
    (mas_pequeno disco4 disco5)

    (sin_nada_encima torre2)
    (sin_nada_encima torre3)
    (sin_nada_encima disco1)

    (encima_de disco5 torre1)
    (encima_de disco4 disco5)
    (encima_de disco3 disco4)
    (encima_de disco2 disco3)
    (encima_de disco1 disco2)
  )
  (:goal
    (and
      (encima_de disco5 torre3)
      (encima_de disco4 disco5)
      (encima_de disco3 disco4)
      (encima_de disco2 disco3)
      (encima_de disco1 disco2)
    )
  )
)

; plan
1. (mover disco2 torre3 disco1)
   deleted: (sin_nada_encima torre3) (encima_de disco1 disco2)
   added: (sin_nada_encima disco2) (encima_de disco1 torre3)
   goals met: 3 of 5
2. (mover disco3 torre2 disco2)
   deleted: (sin_nada_encima torre2) (encima_de disco2 disco3)
   added: (sin_nada_encima disco3) (encima_de disco2 torre2)
   goals met: 2 of 5
3. (mover torre3 disco2 disco1)
   deleted: (sin_nada_encima disco2) (encima_de disco1 torre3)
   added: (sin_nada_encima torre3) (encima_de disco1 disco2)
   goals met: 3 of 5
4. (mover disco4 torre3 disco3)
   deleted: (sin_nada_encima torre3) (encima_de disco3 disco4)
   added: (sin_nada_encima disco4) (encima_de disco3 torre3)
   goals met: 2 of 5
5. (mover disco2 disco4 disco1)
   deleted: (sin_nada_encima disco4) (encima_de disco1 disco2)
   added: (sin_nada_encima disco2) (encima_de disco1 disco4)
   goals met: 1 of 5
6. (mover torre2 disco3 disco2)
   deleted: (sin_nada_encima disco3) (encima_de disco2 torre2)
   added: (sin_nada_encima torre2) (encima_de disco2 disco3)
   goals met: 2 of 5
7. (mover disco4 disco2 disco1)
   deleted: (sin_nada_encima disco2) (encima_de disco1 disco4)
   added: (sin_nada_encima disco4) (encima_de disco1 disco2)
   goals met: 3 of 5
8. (mover disco5 torre2 disco4)
   deleted: (sin_nada_encima torre2) (encima_de disco4 disco5)
   added: (sin_nada_encima disco5) (encima_de disco4 torre2)
   goals met: 2 of 5
9. (mover disco2 disco4 disco1)
   deleted: (sin_nada_encima disco4) (encima_de disco1 disco2)
   added: (sin_nada_encima disco2) (encima_de disco1 disco4)
   goals met: 1 of 5
10. (mover disco3 disco5 disco2)
   deleted: (sin_nada_encima disco5) (encima_de disco2 disco3)
   added: (sin_nada_encima disco3) (encima_de disco2 disco5)
   goals met: 0 of 5
11. (mover disco4 disco2 disco1)
   deleted: (sin_nada_encima disco2) (encima_de disco1 disco4)
   added: (sin_nada_encima disco4) (encima_de disco1 disco2)
   goals met: 1 of 5
12. (mover torre3 disco4 disco3)
   deleted: (sin_nada_encima disco4) (encima_de disco3 torre3)
   added: (sin_nada_encima torre3) (encima_de disco3 disco4)
   goals met: 2 of 5
13. (mover disco2 disco3 disco1)
   deleted: (sin_nada_encima disco3) (encima_de disco1 disco2)
   added: (sin_nada_encima disco2) (encima_de disco1 disco3)
   goals met: 1 of 5
14. (mover disco5 torre3 disco2)
   deleted: (sin_nada_encima torre3) (encima_de disco2 disco5)
   added: (sin_nada_encima disco5) (encima_de disco2 torre3)
   goals met: 1 of 5
15. (mover disco3 disco5 disco1)
   deleted: (sin_nada_encima disco5) (encima_de disco1 disco3)
   added: (sin_nada_encima disco3) (encima_de disco1 disco5)
   goals met: 1 of 5
16. (mover torre3 disco3 disco2)
   deleted: (sin_nada_encima disco3) (encima_de disco2 torre3)
   added: (sin_nada_encima torre3) (encima_de disco2 disco3)
   goals met: 2 of 5
17. (mover disco5 disco2 disco1)
   deleted: (sin_nada_encima disco2) (encima_de disco1 disco5)
   added: (sin_nada_encima disco5) (encima_de disco1 disco2)
   goals met: 3 of 5
18. (mover torre1 torre3 disco5)
   deleted: (sin_nada_encima torre3) (encima_de disco5 torre1)
   added: (sin_nada_encima torre1) (encima_de disco5 torre3)
   goals met: 4 of 5
19. (mover disco2 torre1 disco1)
   deleted: (sin_nada_encima torre1) (encima_de disco1 disco2)
   added: (sin_nada_encima disco2) (encima_de disco1 torre1)
   goals met: 3 of 5
20. (mover disco3 disco5 disco2)
   deleted: (sin_nada_encima disco5) (encima_de disco2 disco3)
   added: (sin_nada_encima disco3) (encima_de disco2 disco5)
   goals met: 2 of 5
21. (mover torre1 disco2 disco1)
   deleted: (sin_nada_encima disco2) (encima_de disco1 torre1)
   added: (sin_nada_encima torre1) (encima_de disco1 disco2)
   goals met: 3 of 5
22. (mover disco4 torre1 disco3)
   deleted: (sin_nada_encima torre1) (encima_de disco3 disco4)
   added: (sin_nada_encima disco4) (encima_de disco3 torre1)
   goals met: 2 of 5
23. (mover disco2 disco4 disco1)
   deleted: (sin_nada_encima disco4) (encima_de disco1 disco2)
   added: (sin_nada_encima disco2) (encima_de disco1 disco4)
   goals met: 1 of 5
24. (mover disco5 disco3 disco2)
   deleted: (sin_nada_encima disco3) (encima_de disco2 disco5)
   added: (sin_nada_encima disco5) (encima_de disco2 disco3)
   goals met: 2 of 5
25. (mover disco4 disco2 disco1)
   deleted: (sin_nada_encima disco2) (encima_de disco1 disco4)
   added: (sin_nada_encima disco4) (encima_de disco1 disco2)
   goals met: 3 of 5
26. (mover torre2 disco5 disco4)
   deleted: (sin_nada_encima disco5) (encima_de disco4 torre2)
   added: (sin_nada_encima torre2) (encima_de disco4 disco5)
   goals met: 4 of 5
27. (mover disco2 disco4 disco1)
   deleted: (sin_nada_encima disco4) (encima_de disco1 disco2)
   added: (sin_nada_encima disco2) (encima_de disco1 disco4)
   goals met: 3 of 5
28. (mover disco3 torre2 disco2)
   deleted: (sin_nada_encima torre2) (encima_de disco2 disco3)
   added: (sin_nada_encima disco3) (encima_de disco2 torre2)
   goals met: 2 of 5
29. (mover disco4 disco2 disco1)
   deleted: (sin_nada_encima disco2) (encima_de disco1 disco4)
   added: (sin_nada_encima disco4) (encima_de disco1 disco2)
   goals met: 3 of 5
30. (mover torre1 disco4 disco3)
   deleted: (sin_nada_encima disco4) (encima_de disco3 torre1)
   added: (sin_nada_encima torre1) (encima_de disco3 disco4)
   goals met: 4 of 5
31. (mover disco2 torre1 disco1)
   deleted: (sin_nada_encima torre1) (encima_de disco1 disco2)
   added: (sin_nada_encima disco2) (encima_de disco1 torre1)
   goals met: 3 of 5
32. (mover torre2 disco3 disco2)
   deleted: (sin_nada_encima disco3) (encima_de disco2 torre2)
   added: (sin_nada_encima torre2) (encima_de disco2 disco3)
   goals met: 4 of 5
33. (mover torre1 disco2 disco1)
   deleted: (sin_nada_encima disco2) (encima_de disco1 torre1)
   added: (sin_nada_encima torre1) (encima_de disco1 disco2)
   goals met: 5 of 5
